## Terraform checks in directory 'infra'
#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`
[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Finding cloudflare/cloudflare versions matching "~> 5.0"...
- Installing cloudflare/cloudflare v5.0.0...
- Installed cloudflare/cloudflare v5.0.0 (self-signed, key ID [0m[1mC76001609EE3B136[0m[0m)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
`
#### Terraform Plan 📖`
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_dns_record.gsc_kubefest_com will be created
  + resource "cloudflare_dns_record" "gsc_kubefest_com" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = "google-site-verification=eTKt9_NpprU6T0FDPi-He0oZirSyEZqDMOBqmKfMNpc"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "kubefest.com"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "TXT"
      + zone_id             = (known after apply)
    }

  # cloudflare_dns_record.kubefest_com will be created
  + resource "cloudflare_dns_record" "kubefest_com" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = "cloudnativerioja.github.io"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "kubefest.com"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = (known after apply)
    }

  # cloudflare_dns_record.www_kubefest_com will be created
  + resource "cloudflare_dns_record" "www_kubefest_com" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = "cloudnativerioja.github.io"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "www"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = (known after apply)
    }

  # cloudflare_dns_record.year_2024_kubefest_com will be created
  + resource "cloudflare_dns_record" "year_2024_kubefest_com" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = "cloudnativerioja.github.io"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "2024"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = (known after apply)
    }

  # cloudflare_zone.kubefest will be created
  + resource "cloudflare_zone" "kubefest" {
      + account               = {
          + id = "d825c9e713aa088bcf94473de992118b"
        }
      + activated_on          = (known after apply)
      + created_on            = (known after apply)
      + development_mode      = (known after apply)
      + id                    = (known after apply)
      + meta                  = (known after apply)
      + modified_on           = (known after apply)
      + name                  = "kubefest.com"
      + name_servers          = (known after apply)
      + original_dnshost      = (known after apply)
      + original_name_servers = (known after apply)
      + original_registrar    = (known after apply)
      + owner                 = (known after apply)
      + paused                = false
      + status                = (known after apply)
      + type                  = "full"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
`